/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "main": {
      "type": "main-page",
      "disabled": true,
      "settings": {
        "padding_top": 96,
        "padding_bottom": 28
      }
    },
    "rich_text_4wBXPh": {
      "type": "rich-text",
      "blocks": {
        "heading_ykeTAa": {
          "type": "heading",
          "settings": {
            "heading": "Namkeen Wholesalers & Distributors: Delivering India’s Favorite Snacks with Taste, Trust, and Tradition",
            "heading_size": "h1"
          }
        },
        "text_LpzQBQ": {
          "type": "text",
          "settings": {
            "text": "<p>India’s snack culture is as diverse as its people, and one name that binds all corners of the country together is Namkeen. From the spicy sev of Indore to the crispy bhujia of Rajasthan and the tangy mixture of Uttar Pradesh, Namkeen is not just a snack — it’s an emotion, a daily companion to tea-time and laughter. At the heart of this flavorful journey stand the Namkeen Wholesalers & Distributors, the unsung heroes who bring these tasty bites to every neighborhood, store shelf, and household.</p><p>Among the pioneers in this flavorful industry, Family Namkeen, crafted by Bakers Agri Foods Pvt. Ltd. under the leadership of Mr. S.R. Agarwal, has been redefining taste and trust since 1989. With over three decades of experience, the brand has become a symbol of quality, freshness, and authentic Indian snacking.</p>"
          }
        }
      },
      "block_order": [
        "heading_ykeTAa",
        "text_LpzQBQ"
      ],
      "name": "t:sections.rich-text.presets.name",
      "settings": {
        "desktop_content_position": "center",
        "content_alignment": "left",
        "color_scheme": "",
        "full_width": true,
        "padding_top": 68,
        "padding_bottom": 52
      }
    },
    "rich_text_Hj8eKe": {
      "type": "rich-text",
      "blocks": {
        "heading_yTKHBa": {
          "type": "heading",
          "settings": {
            "heading": "<strong>The Growing Market of Namkeen in India</strong>",
            "heading_size": "h1"
          }
        },
        "text_Ec9edK": {
          "type": "text",
          "settings": {
            "text": "<p>The Indian snack industry has witnessed tremendous growth over the last decade, and Namkeen holds a major share in it. With the increasing demand for quick bites, ready-to-eat products, and regional flavors, the role of Namkeen Wholesalers & Distributors has become more vital than ever.</p><p>According to market insights, the Indian Namkeen industry is expected to grow at a CAGR of over 10% in the coming years. Consumers today look for taste, hygiene, variety, and brand trust, and companies like Family Namkeen have set a benchmark in all these areas. Wholesalers and distributors are the essential link connecting traditional taste-makers with millions of snack lovers across cities and rural markets alike.</p>"
          }
        }
      },
      "block_order": [
        "heading_yTKHBa",
        "text_Ec9edK"
      ],
      "name": "t:sections.rich-text.presets.name",
      "settings": {
        "desktop_content_position": "center",
        "content_alignment": "left",
        "color_scheme": "",
        "full_width": true,
        "padding_top": 40,
        "padding_bottom": 52
      }
    },
    "rich_text_qtc6BT": {
      "type": "rich-text",
      "blocks": {
        "heading_tRaxV4": {
          "type": "heading",
          "settings": {
            "heading": "<strong>Who Are Namkeen Wholesalers & Distributors?</strong>",
            "heading_size": "h1"
          }
        },
        "text_rdQX9Q": {
          "type": "text",
          "settings": {
            "text": "<p><strong>Namkeen Wholesalers & Distributors</strong> play a crucial role in the snack supply chain. They act as the bridge between manufacturers and retailers, ensuring that every product reaches customers in its freshest, most flavorful form.</p><p>Their key responsibilities include:</p><ul><li><strong>Bulk Procurement:</strong> Purchasing Namkeen and snack products directly from manufacturers at wholesale rates.<br/></li><li><strong>Distribution:</strong> Supplying to retail outlets, supermarkets, and online sellers.<br/></li><li><strong>Market Expansion:</strong> Helping brands like <strong>Family Namkeen</strong> reach untapped markets and grow their presence.<br/></li><li><strong>Inventory Management:</strong> Ensuring steady stock availability to meet market demand.<br/></li><li><strong>Quality Assurance:</strong> Maintaining product freshness through proper storage and logistics.<br/></li></ul><p>In essence, without Namkeen wholesalers and distributors, the crunchy delights we enjoy daily might never make it from the factory to your favorite tea table.</p>"
          }
        }
      },
      "block_order": [
        "heading_tRaxV4",
        "text_rdQX9Q"
      ],
      "name": "t:sections.rich-text.presets.name",
      "settings": {
        "desktop_content_position": "center",
        "content_alignment": "left",
        "color_scheme": "",
        "full_width": true,
        "padding_top": 40,
        "padding_bottom": 52
      }
    },
    "rich_text_QqNnqq": {
      "type": "rich-text",
      "blocks": {
        "heading_bn84UP": {
          "type": "heading",
          "settings": {
            "heading": "<strong>Why Family Namkeen is a Trusted Name Among Wholesalers & Distributors</strong>",
            "heading_size": "h1"
          }
        },
        "text_pEhhWj": {
          "type": "text",
          "settings": {
            "text": "<p>For over 35 years, <strong>Family Namkeen</strong> has been the preferred choice for <strong>Namkeen Wholesalers & Distributors</strong> due to its consistent quality, wide range of products, and strong market reputation. Let’s look at what makes the brand stand out:</p><h4><strong>1. Legacy of Trust Since 1989</strong></h4><p>Founded by <strong>Mr. S.R. Agarwal</strong>, Family Namkeen was born with a vision to bring authentic taste to every home. Over the years, the brand has earned a reputation for reliability and superior quality — values that wholesalers and distributors depend on.</p><h4><strong>2. Crafted by Bakers Agri Foods Pvt. Ltd.</strong></h4><p>Under the craftsmanship of <strong>Bakers Agri Foods Pvt. Ltd.</strong>, every product from Family Namkeen carries the hallmark of quality. With advanced manufacturing units and strict hygiene protocols, the company ensures every bite remains true to its promise — <em>fresh, safe, and delicious.</em></p><h4><strong>3. A Diverse Product Range</strong></h4><p>Family Namkeen offers a complete assortment of Indian snacks, making it a one-stop solution for wholesalers and distributors. The product line includes:</p><ul><li><strong>Namkeen</strong> – Bhujia, Mixture, Sev, Chiwda, Aloo Bhujia, and more.<br/></li><li><strong>Snacks</strong> – Masala Sticks, Spicy Mix, and traditional Indian munchies.<br/></li><li><strong>Rusk</strong> – Crispy and golden rusks perfect for tea-time.<br/></li><li><strong>Sweets</strong> – Authentic Indian mithai crafted with pure ingredients.<br/></li><li><strong>Chips</strong> – Crunchy potato chips and regional flavors loved by all ages.<br/></li><li><strong>Cookies</strong> – Soft, buttery, and baked with love.<br/></li></ul><p>Such product diversity ensures that Family Namkeen Wholesalers & Distributors always have something for every customer segment — from traditional snack lovers to modern-day foodies.</p><h4><strong>4. Hygienic Production & Packaging</strong></h4><p>Family Namkeen blends age-old recipes with cutting-edge hygiene and packaging standards. Each product is prepared using premium ingredients and packed with care to retain freshness and flavor. For distributors, this ensures longer shelf life and zero wastage — key factors in profitability.</p><h4><strong>5. Wide Distribution Network</strong></h4><p>Over the decades, the company has built a strong and reliable distribution network across Uttar Pradesh and neighboring states. This robust system helps maintain seamless delivery and stock availability, earning the trust of hundreds of wholesalers and retailers.</p>"
          }
        }
      },
      "block_order": [
        "heading_bn84UP",
        "text_pEhhWj"
      ],
      "name": "t:sections.rich-text.presets.name",
      "settings": {
        "desktop_content_position": "center",
        "content_alignment": "left",
        "color_scheme": "",
        "full_width": true,
        "padding_top": 40,
        "padding_bottom": 52
      }
    }
  },
  "order": [
    "main",
    "rich_text_4wBXPh",
    "rich_text_Hj8eKe",
    "rich_text_qtc6BT",
    "rich_text_QqNnqq"
  ]
}
