/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "main": {
      "type": "main-page",
      "disabled": true,
      "settings": {
        "padding_top": 96,
        "padding_bottom": 28
      }
    },
    "rich_text_Bna8iG": {
      "type": "rich-text",
      "blocks": {
        "heading_FF6WmH": {
          "type": "heading",
          "settings": {
            "heading": "<strong>35+ Years of Trust</strong>",
            "heading_size": "h1"
          }
        },
        "text_8UdDqT": {
          "type": "text",
          "settings": {
            "text": "<p>(Our Journey)</p>"
          }
        }
      },
      "block_order": [
        "heading_FF6WmH",
        "text_8UdDqT"
      ],
      "name": "t:sections.rich-text.presets.name",
      "settings": {
        "desktop_content_position": "center",
        "content_alignment": "center",
        "color_scheme": "",
        "full_width": true,
        "padding_top": 40,
        "padding_bottom": 52
      }
    },
    "image_banner_6AqgXE": {
      "type": "image-banner",
      "name": "t:sections.image-banner.presets.name",
      "settings": {
        "image": "shopify://shop_images/WhatsApp_Image_2026-01-16_at_3.28.17_PM.jpg",
        "image_overlay_opacity": 0,
        "image_height": "adapt",
        "image_behavior": "none",
        "desktop_content_position": "middle-center",
        "desktop_content_alignment": "center",
        "show_text_box": true,
        "color_scheme": "",
        "stack_images_on_mobile": true,
        "mobile_content_alignment": "center",
        "show_text_below": true
      }
    },
    "rich_text_XefG4m": {
      "type": "rich-text",
      "blocks": {
        "text_NhzUGM": {
          "type": "text",
          "settings": {
            "text": "<h3><strong>Founding Story:</strong></h3><p>In the late 80s, Mr. Sri Ram Agarwal ade a bold decision to enter the snacking industry and create a unique identity for himself. His vision and entrepreneurial spirit led to the birth of Family Snacks. Driven by a commitment to quality and innovation, Mr. Agarwal focused on producing snack products that families could trust and enjoy.</p><p>This marked the beginning of a uccessful journey, as the brand quickly gained recognition for its reliable and delicious offerings, laying the foundation for a lasting presence in the market.</p><p><strong>In 2009,</strong>we embarked on a delicious journey by establishing our anufacturing unit in <strong>Malwa, Fatehpur</strong>. Armed with a vision to provide high-quality snacks, we started manufacturing two core products: <strong>Cookies and Rusk</strong>.</p><p>Our foundational belief was to create snacks that not only satisfy cravings but also deliver on taste and quality. Rusk was launched with a production capacity of <strong>5 Metric Tons</strong>.</p><p><strong>In 2013,</strong>the company made significant advancements by launching a range of <strong>salty snacks</strong>, diversifying its product offerings.</p><p>Furthermore, it became the first brand in the <strong>Eastern Uttar Pradesh (U.P.)</strong> region to adopt <strong>tunnel oven technology</strong>, which is typically used to improve the efficiency and quality of baking processes.</p><p>This technological upgrade helped enhance production capabilities and consistency in the product.</p><p>In addition to this, the company increased its rusk production capacity by <strong>10 Metric Tons</strong>. This boost in production capacity allowed the company to meet growing consumer demand and expand its market share in the region.</p><p><strong>From 2016,</strong> the company continuously upgraded its factory by equipping it with <strong>high-tech machinery</strong>. These technological advancements significantly improved production efficiency and product quality.</p><p>As a result, the company experienced a substantial increase in production capacity, allowing it to meet rising demand more effectively.</p><p>The enhanced production capabilities also contributed to an expansion in the company's <strong>distribution network</strong>. The increased output enabled the company to partner with more distributors, thereby broadening its market reach and strengthening its presence across regions.</p><p>This expansion played a key role in boosting the company's growth and competitiveness during this period.</p><p><strong>In 2020,</strong>the company adopted <strong>world-class technology</strong> for the production of rusks, cookies, and namkeen.</p><p>This upgrade in manufacturing technology allowed the company to enhance the quality, consistency, and efficiency of its production processes. By incorporating advanced machinery and techniques, the company was able to meet high production demands while ensuring superior product quality.</p><p>This technological leap also positioned the company to stay competitive in the rapidly evolving snack and bakery industry.</p><p><strong>In 2024</strong>, the company further expanded its product portfolio by launching <strong>potato chips</strong>.</p><p>This move marked a strategic effort to diversify its offerings in the snack industry, catering to the growing consumer demand for crispy, flavourful snacks.</p><p>The introduction of potato chips aimed to capture a larger market share and appeal to a wider range of snack enthusiasts, further strengthening the company's position in the competitive snack market.</p><p><strong>At Present:</strong> The company is currently in the process of setting up a manufacturing unit for <strong>sweets</strong>.</p><p>This strategic move signifies its ambition to further diversify its product portfolio and tap into the growing demand for confectionery items.</p><p>By expanding into the sweets segment, the company aims to offer a broader range of products to its customers, enhancing its presence in the food industry.</p><p>The new manufacturing unit will feature advanced technology to ensure high-quality production, aligning with the company's commitment to innovation and excellence.</p><h3><strong>Company Network:</strong></h3><p>Our expansive network of <strong>350+ Distributors</strong> spans diverse regions, ensuring our products are available to a broad customer base.</p><p>Each distributor is a valued partner, playing a crucial role in maintaining our reputation for quality and dependability.</p><h3><strong>Future Vision:</strong></h3><p><em>Looking ahead, our company is committed to achieving ambitious goals:</em></p><ul><li><strong>Enhanced Production Capacity:</strong> We aim to reach a rusk production capacity of <strong>25 Metric Tons by 2025</strong>, ensuring we meet the growing demand for our products.</li><li><strong>Expanded Product Range:</strong> We plan to introduce a wider range of products, catering to diverse customer preferences and enhancing our market presence.</li><li><strong>Improved Services:</strong> Continuously striving for excellence, we aim to provide better services that exceed customer expectations.</li><li><strong>Network Growth:</strong> Our vision includes expanding our network by adding more super stockists and distributors, strengthening our reach and operational efficiency.</li><li><strong>Brand Vision:</strong> Our vision is to become the most trusted and innovative brand in the packaged food industry in India, transforming the way people experience food through quality, convenience, and authenticity.</li></ul>"
          }
        }
      },
      "block_order": [
        "text_NhzUGM"
      ],
      "custom_css": [
        "@media screen and (min-width: 990px) {.rich-text__blocks {max-width: 100%; }}"
      ],
      "name": "t:sections.rich-text.presets.name",
      "settings": {
        "desktop_content_position": "left",
        "content_alignment": "left",
        "color_scheme": "",
        "full_width": true,
        "padding_top": 40,
        "padding_bottom": 52
      }
    }
  },
  "order": [
    "main",
    "rich_text_Bna8iG",
    "image_banner_6AqgXE",
    "rich_text_XefG4m"
  ]
}
